[{"data":1,"prerenderedAt":80},["ShallowReactive",2],{"content-query-9hnCA8gJ9J":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":8,"date":9,"preview":5,"draft":6,"tags":10,"categories":13,"slug":14,"body":15,"_type":74,"_id":75,"_source":76,"_file":77,"_stem":78,"_extension":79},"/intro-to-writing-blogs","",false,"Why do I write Blogs?","Writing blog helps me document my learning journey and this might help other developers also.","September 02, 2024",[11,12],"personal","blog",[12],"why-do-i-write-blogs",{"type":16,"children":17,"toc":71},"root",[18,26,32,37,42,47,52,61,66],{"type":19,"tag":20,"props":21,"children":22},"element","h4",{"id":14},[23],{"type":24,"value":25},"text","Why Do I Write Blogs",{"type":19,"tag":27,"props":28,"children":29},"p",{},[30],{"type":24,"value":31},"Hi, I am Yvan Sabay - a Full Stack Web Developer with years of experience and has passion for continuous learning. I’m dedicated to exploring new technologies and skills to grow in my career. Outside of coding, I enjoy playing basketball and hitting the gym to stay active and balanced.",{"type":19,"tag":27,"props":33,"children":34},{},[35],{"type":24,"value":36},"My journey as a developer began in college, and to be honest, I wasn’t great at coding when I started—even now lol. I spent countless hours trying to understand how things work, figuring out how to implement features, and building personal projects, mostly by following YouTube tutorials, reading documentations, and searching for answers on StackOverflow whenever I encounter a bug. Over time, I discovered how much I enjoyed the process of creating something from scratch. It’s a journey filled with challenges, but every small win keeps me motivated to keep improving.",{"type":19,"tag":27,"props":38,"children":39},{},[40],{"type":24,"value":41},"What fascinated me the most was how being a developer constantly pushes you to learn—whether it’s understanding how something works or exploring new technologies. This passion for learning not only deepened my skills but also helped support my studies. Looking back, those early struggles laid the foundation for the developer I am today.",{"type":19,"tag":27,"props":43,"children":44},{},[45],{"type":24,"value":46},"As someone who’s constantly exploring different technologies and tech stacks, I’ve found it challenging to remember all the important details, especially those that aren’t always obvious in official documentation. While docs are a great reference, there are often crucial insights or practical applications that only come to light when you’re actually working on a project. Writing blogs helps me capture these key takeaways and organize my thoughts in a way that’s easy to revisit later.",{"type":19,"tag":27,"props":48,"children":49},{},[50],{"type":24,"value":51},"Through blogging, I can dive deeper into specific technologies or challenges I’m working on and create a personal resource to guide me in future projects. It’s like building a personalized knowledge base—something I can refer back to when I need clarity or direction. By reflecting on my experiences and documenting my processes, I not only solidify my understanding but also make it easier to pick up where I left off. This practice has become an invaluable part of my learning process and growth as a developer.",{"type":19,"tag":27,"props":53,"children":54},{},[55],{"type":19,"tag":56,"props":57,"children":58},"strong",{},[59],{"type":24,"value":60},"I want to be honest—while I can speak English conversationally, writing blogs has always been a challenge for me. To help express my ideas more clearly, I use ChatGPT to refine my writing and structure my thoughts. I feed my ideas, experiences, and learnings into it, and it helps me shape them into better-written pieces.",{"type":19,"tag":27,"props":62,"children":63},{},[64],{"type":24,"value":65},"Every thought and idea shared here is genuinely mine, from my personal journey and insights. Writing these blogs not only helps me document what I’ve learned but also allows me to improve my communication skills along the way. Thank you for reading and supporting me in this process!",{"type":19,"tag":27,"props":67,"children":68},{},[69],{"type":24,"value":70},"If you have any projects, ideas, or opportunities you think I could help with, I’d love to hear from you! I’m always open to new challenges and collaborations. And if you’re looking for someone to join your team, I’d be thrilled to contribute my skills and passion as a developer. Let’s connect and create something amazing together!",{"title":5,"searchDepth":72,"depth":72,"links":73},2,[],"markdown","content:00.intro-to-writing-blogs.md","content","00.intro-to-writing-blogs.md","00.intro-to-writing-blogs","md",1736081751403]